// JavaScript Document
/*
 * 文件名：verify.js
 * 功能：正则表达式校验
 * 作者：袁景山
 * 时间：2015-07-14
 */

// 手机号码
var mobile = /^(1)[0-9]{10}$/;
// 包括验证国内区号,国际区号,分机号
var tel = /^(([0\\+]\\d{2,3}-)?(0\\d{2,3})-)?(\\d{7,8})(-(\\d{3,}))?$/;
// 国内电话号码
var gntel = /^\d{3}-\d{8}|\d{4}-\d{7,8}$/;
// QQ号码
var qq = /^[1-9]*[1-9][0-9]*$/;
// 金融IC卡 6开头的卡：银联卡，4开头的卡：携带Visa标志，5开头的卡：携带Master，3开头的：携带JCB标志。
var ICCard = /^[6|5|4|3][0-9]{15,18}$/;
// url
var httpUrl = /^[a-zA-z]+:\/\/[^\s]*$/;	
// 仅中文
var chinese = /^[\\u4E00-\\u9FA5\\uF900-\\uFA2D]+$/;					
// 整数
var int = /^-?[1-9]\\d*$/;
// 正整数
var zint = /^[1-9]\d*$/;
// 负整数
var fint = /^-[1-9]\\d*$/;
// 数字
var num = /^([+-]?)\\d*\\.?\\d+$/;
// 正数（正整数 + 0）
var znum = /^[1-9]\\d*|0$/;
// 负数（负整数 + 0）
var fnum = /^-[1-9]\\d*|0$/;
// 浮点数
var float = /^([+-]?)\\d*\\.\\d+$/;
// 正浮点数
var zfloat = /^[1-9]\\d*.\\d*|0.\\d*[1-9]\\d*$/;
// 负浮点数　	
var ffloat = /^-([1-9]\\d*.\\d*|0.\\d*[1-9]\\d*)$/;
// 浮点数
var double = /^-?([1-9]\\d*.\\d*|0.\\d*[1-9]\\d*|0?.0+|0)$/;
// 非负浮点数（正浮点数 + 0）
var zdouble = /^[1-9]\d*\.\d*|0\.\d*[1-9]\d*|0?.0+|0$/;
// 非正浮点数（负浮点数 + 0）
//var fdouble = /^(-([1-9]\\d*.\\d*|0.\\d*[1-9]\\d*))|0?.0+|0$/;　　
// 邮件
//var email = /^\\w+((-\\w+)|(\\.\\w+))*\\@[A-Za-z0-9]+((\\.|-)[A-Za-z0-9]+)*\\.[A-Za-z0-9]+$/;
//var email = /^[\w!#$%&'*+/=?^_`{|}~-]+(?:\.[\w!#$%&'*+/=?^_`{|}~-]+)*@(?:[\w](?:[\w-]*[\w])?\.)+[\w](?:[\w-]*[\w])?$/;
// 邮编
//var zipcode = /^[1-9]\d{5}(?!\d)$/;
// 颜色
var color = /^[a-fA-F0-9]{6}$/;
// 仅ACSII字符
var ascii = /^[\\x00-\\xFF]+$/;		
// ip地址
var ip4 = /^(25[0-5]|2[0-4]\\d|[0-1]\\d{2}|[1-9]?\\d)\\.(25[0-5]|2[0-4]\\d|[0-1]\\d{2}|[1-9]?\\d)\\.(25[0-5]|2[0-4]\\d|[0-1]\\d{2}|[1-9]?\\d)\\.(25[0-5]|2[0-4]\\d|[0-1]\\d{2}|[1-9]?\\d)$/;
// 非空
var notempty = /^\\S+$/;
// 图片
var picture = /(.*)\\.(jpg|bmp|gif|ico|pcx|jpeg|tif|png|raw|tga)$/;
// 压缩文件
var rar = /(.*)\\.(rar|zip|7zip|tgz)$/;	
// 日期
//var date = /^\\d{4}(\\-|\\/|\.)\\d{1,2}\\1\\d{1,2}$/;
var date = /^([0-9]{3}[1-9]|[0-9]{2}[1-9][0-9]{1}|[0-9]{1}[1-9][0-9]{2}|[1-9][0-9]{3})-(((0[13578]|1[02])-(0[1-9]|[12][0-9]|3[01]))|((0[469]|11)-(0[1-9]|[12][0-9]|30))|(02-(0[1-9]|[1][0-9]|2[0-8])))$/;
// QQ号码
var qq = /^[1-9]*[1-9][0-9]*$/;				
// 用来用户注册。匹配由数字、26个英文字母或者下划线组成的字符串
var numletter = /^\\w+$/;
// 字母
var letter = /^[A-Za-z]+$/;
// 大写字母
var letter_u = /^[A-Z]+$/;
// 小写字母
var letter_l = /^[a-z]+$/;
// 身份证
var idcard = /^[1-9]([0-9]{14}|[0-9]{17})$/;	

// 管理员密码
var manager_password = /^\w{6,20}$/;